app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find(params[:id]) #trouver l'article via son ID

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Premier article"], ["text", "Contenu du premier article !"], ["created_at", "2015-10-26 11:09:57.275474"], ["updated_at", "2015-10-26 11:09:57.275474"]]
---
  def create
    @article = Article.new(articles_params)
    if @article.save #Sauvegarde le modèle dans la BDD

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article test v2"], ["text", "test de contenu v2"], ["updated_at", "2015-10-26 14:47:55.277863"], ["id", 7]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(articles_params)